In [1]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_csv(r"C:\Users\ismail\Downloads\Compressed\movies.csv")
df

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
10324,146684,Cosmic Scrat-tastrophe (2015),Animation|Children|Comedy
10325,146878,Le Grand Restaurant (1966),Comedy
10326,148238,A Very Murray Christmas (2015),Comedy
10327,148626,The Big Short (2015),Drama
10328,149532,Marco Polo: One Hundred Eyes (2015),(no genres listed)

In [55]:
df.describe()

             movieId
count   10329.000000
mean    31924.282893
std     37734.741149
min         1.000000
25%      3240.000000
50%      7088.000000
75%     59900.000000
max    149532.000000

In [8]:
df.shape

(10329, 3)

In [16]:
df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [11]:
df.tail()

       movieId                                title                     genres
10324   146684        Cosmic Scrat-tastrophe (2015)  Animation|Children|Comedy
10325   146878           Le Grand Restaurant (1966)                     Comedy
10326   148238       A Very Murray Christmas (2015)                     Comedy
10327   148626                 The Big Short (2015)                      Drama
10328   149532  Marco Polo: One Hundred Eyes (2015)         (no genres listed)

In [15]:
df.count()

movieId    10329
title      10329
genres     10329
dtype: int64

In [44]:
names = ["tahir","qamar","saboor","saboor"]
s = pd.Series(names)
s

0     tahir
1     qamar
2    saboor
3    saboor
dtype: object

In [60]:
df_2 = pd.DataFrame([["name","cast","class","marks"],
                    ["irfan","khaskheli","BS",75],
                    ["qamar","gilal","BS",55],
                    ["shoab","malah","MS",90],
                    ["tahir","khoso","PhD",60]],)
df_2

       0          1      2      3
0   name       cast  class  marks
1  irfan  khaskheli     BS     75
2  qamar      gilal     BS     55
3  shoab      malah     MS     90
4  tahir      khoso    PhD     60

In [97]:
df_2[1:3]

       0          1   2   3
1  irfan  khaskheli  BS  75
2  qamar      gilal  BS  55

In [61]:
df_2.describe()

            0      1   2      3
count       5      5   5      5
unique      5      5   4      5
top     irfan  malah  BS  marks
freq        1      1   2      1

In [73]:
df_2[1]

0         cast
1    khaskheli
2        gilal
3        malah
4        khoso
Name: 1, dtype: object